'''作业题如有不会做的，空着就好了，不必在题目上纠结太长时间，解答课会给出答案的。
根据上一次作业的反馈，为了照顾大多数同学，作业难度会降低，参考此次作业难度.
'''

#第三次作业
##
##1.a = '苦短' b = 'Python' 用4种方法，输出'人生苦短，我用Python'
a = '苦短'
b = 'Python'
print('人生'+a+',我用'+b)
print('人生%s,我用%s' % (a,b))
print('人生{},我用{}' .format(a,b))
print(''.join(['人生',a,',','我用',b]))

##2.列表li = ['I','like','python'],用2种方法，将列表转成字符串，输出'I like python'
li = ['I','like','python']
print(li[0]+' '+li[1] +' '+li[2] )
print(' '.join(li))
print('{} {} {}'.format(li[0],li[1],li[2]))

##3. a=1.1，用3种格式，输出 a 的值： 字符串格式， 整型格式， （浮点型+带加号+靠右端）
a = 1.1
'%s'%a
'%d'%a
'%+20f'%a
