#python基础 第四次作业

#1.有两个列表 x = [1,2,3,'a','b','c']  y = ['a','b','c'] 找出x列表中在y 中也有的元素
x = [1,2,3,'a','b','c']
y = ['a','b','c']
s1 = set(x)
s2 = set(y)
s1 & s2
#没想到的方法：
x and y
#2.新建一个字典，用3种方法往字典里面插入值；用 4 种方法取出values，用2种方法取出key
di = {'a':1,'b':2,'c':3}
#插入
di['d'] = 4
di.setdefault('e',5)
di.update({'f':6})
#取出
di['a']
di.get('a')
list(di.values())[0]
di.setdefault('a',666)
list(di.items())[0][1]
#di.pop('a')
#di.popitem()[1]

#取出key
list(di)[0]
list(di.keys())[0]
list(di.items())[0][0]

#3.定义我们学过的每种数据类型，并且注明，哪些是可变，哪些是不可变的.
#  试着写一个嵌套字典，和一个嵌套集合，内容随意。
#1,1.2,True,1+2j,'abc',[1,2],(1,),{'a':1},{1,2,3}
#在id不变的情况下，可以改变值

#可变 列表，字典，集合
li1 = [1,2,3]
set1 = {1,2,3}
dict1 = {'a':1}
#不可变：字符串，元祖

s = 'abc'
tu = (1,2,3)

dict2 = {'a':[1,2,3],'b':{'a':[1,2,3],'b':(1,2,3)}}
set2 = {1,2,3,'aaa',(1,2,3)}
#集合是一个无序的，由多个唯一元素组成的集合。
#不可哈希类型对应的是可变对象

#4.s1 = set(1,2,3)，s2 = set(1,[2,3]) ， s3 = set([1,2,3])
# 声明这3个变量，为何有的会报错？分析结果，解释出现这种结果的原因。

##s1 = set(1,2,3) #必须传入可迭代对象
##s1 = set((1,2,3))#传入元祖则不会报错
##
##s2 = set(1,[2,3]) #必须传入可迭代对象
##
##s3 = set([1,2,3]) #传入列表-正确
##




